CheatSheet.org
# Reading here last:
# http://cs.union.edu/~striegnk/learn-prolog-now/html/node34.html#sec.l4.member
#

:More:
% types
p(1). p(2). p(3).
q(2). q(3).

% intersection.
int(X) :- p(X), q(X).

% no solns
empty(X) :- p(X),!, q(X).

% product type
prod(X, Y) :- p(X), q(Y).

% section / currying
cur(X, Y) :- p(X), !, q(Y).

% first element in product tpye
one(X, Y) :- p(X), q(Y), !.

% n ↦ Σ i : 0..n • i
% n ↦ Σⁿᵢ₌₀ i
upto_(0, 0).
upto_(N, Tot) :-
    M is N - 1,
    upto_(M, TotM),
    Tot is TotM + N.
/*
  Σⁿᵢ₌₀ i  ≈  n + Σⁿ⁻¹ᵢ₌₀ i
  upto n   ≈  n + upto (n-1)
*/

% PROBLEM:
% If we press “;” for query
% upto_(5, Tot)
% we get an attempt to find
% multiple solutions
% and non-termination.

% cut out choice of clauses
% when base case is encountered.
upto(0, 0) :- !.
upto(N, Tot) :-
    M is N - 1,
    upto(M, TotM),
    Tot is TotM + N.

:End:

#+TITLE: Prolog CheatSheet
# +SUBTITLE: ---Reference Sheet for “What I'm Currently Learning”---
#+MACRO: blurb Refernece card for getting started with Prolog.
#+AUTHOR: [[http://www.cas.mcmaster.ca/~alhassm/][Musa Al-hassy]]
#+EMAIL: alhassy@gmail.com
#+INCLUDE: CheatSheetSetup.org
#+PROPERTY: header-args :tangle "CheatSheet.pl" :comments link
#+TODO: Todo | spacing LaTeX

* LaTeX Extra, Local, Setup  :ignore:

#+HTML_HEAD: <style>.parallel {width: 100%;}</style>

# Empty by default.
#+MACRO: url https://github.com/alhassy/PrologCheatSheet
#+LATEX_HEADER: \def\cheatsheeturl{https://github.com/alhassy/PrologCheatSheet}

# The following are the defaults & may be omitted.
#+LATEX_HEADER: \def\cheatsheetcols{2}
#+LATEX_HEADER: \landscapetrue
#+LATEX_HEADER: \def\cheatsheetitemsep{-0.5em}

# Example unicode declarations; see section “unicode” below.
#+LATEX_HEADER: \newunicodechar{𝑻}{\ensuremath{T}}
#+LATEX_HEADER: \newunicodechar{⊕}{\ensuremath{\oplus}}
#+LATEX_HEADER: \newunicodechar{≈}{\ensuremath{\approx}}

#+LATEX_HEADER: \newunicodechar{ℰ}{\ensuremath{\mathcal{E}}}
#+LATEX_HEADER: \newunicodechar{𝓍}{\ensuremath{\mathit{x}}}
#+LATEX_HEADER: \newunicodechar{𝓅}{\ensuremath{\mathit{p}}}
#+LATEX_HEADER: \newunicodechar{𝓇}{\ensuremath{\mathit{r}}}

* COMMENT Homemade Interactive Prolog Setup

In Prolog, one declares a relationship ~r(x0, x1, …, xn)~ to be true for the declared
~xi~ ---with a change of perspective any of the ~xi~ can be considered ‘input’ and the
rest considered ‘output’.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package prolog)

;; Obtain “swipl” interpreter.
(async-shell-command "brew install swi-prolog")

;; alhassy-air:~ musa$ swipl --version
;; SWI-Prolog version 8.0.2 for x86_64-darwin
#+END_SRC

The following did not work for me :'( ---so I made my own lolz.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package ob-prolog)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((prolog . t)))

(use-package ediprolog)
#+END_SRC

Here's my current setup:
#+BEGIN_SRC emacs-lisp :tangle no
(local-set-key (kbd "<f6>") (lambda () (interactive)
  "org-babel-tangle the whole file, then execute the final query
    in the current, or next-most, SRC block."
  (let (kill-buffer-query-functions
        (inhibit-read-only t)
        (pl-file (car (org-babel-tangle))))

    ;; Kill *Prolog* buffer
    (ignore-errors
      (switch-to-buffer "*Prolog*")
      (kill-buffer "*Prolog*"))

    ;; Get final query in current source block
    (search-forward "#+END_SRC")
    (search-backward "% ?-")

    ;; Copy line, without killing it.
    (setq xx (thing-at-point 'line t))

    ;; Open the terminal, tangling & loading all Prolog code
    (split-window) (other-window 1)
    (ansi-term "swipl" "Prolog")
    (term-send-raw-string (format "consult('%s').\n" pl-file)))

    ;; Send the final query, i.e., “paste it and press enter at prompt”.
    (setq xx (s-chop-prefix "% ?- " xx))
    (term-send-raw-string (format "%s\n" xx))))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | org-babel-tangle the whole file, then execute the final query |

(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)

#+RESULTS:
| lambda | nil | (interactive) |

:Old_EShell:
#+BEGIN_SRC emacs-lisp :tangle no
(local-set-key (kbd "<f6>") (lambda () (interactive)
  "
    org-babel-tangle the whole file, then execute the final query
    in the current SRC block.

    If the query mentions the variable ‘X’, then show all possible solutions
    followed by ‘false’. Usually one presses ‘;’ to see other solutions,
    but in Emacs this only shows one futher solution then terminates.
    We get around this by executing essentially
    “forall(your-query-with-X, writeln(X)).”
    This prints all solutions X to your query.

    If you want to use a variable but don't want to see all solutions,
    then avoid using ‘X’; e.g., use ‘Y’ ^_^.
  "
  (-let [kill-buffer-query-functions nil]
  (ignore-errors
     (switch-to-buffer "*Prolog*")
     (kill-buffer "*Prolog*"))

  ;; Get final query in current source block
  (search-forward "#+END_SRC")
  (search-backward "% ?-")
  ;; Copy line, without killing it.
  (setq xx (thing-at-point 'line t))

  (async-shell-command (format "swipl -s %s" (car (org-babel-tangle))) "*Prolog*")
  (other-window 1)

  ;; Paste the final query
  (setq xx (s-chop-prefix "% ?- " xx))
  (when (s-contains? "X" xx)
    (setq xx (concat "writeln(\"X =\"), forall(" (s-replace "." ", writeln(X))." xx))))

  (insert xx)
  (comint-send-input nil t) ;; Send it, i.e., “press enter at prompt”.

  ;; Insert query again, but do not send, in case user wishes to change it.
  (insert xx)
  (previous-line) (end-of-line)

)))
#+END_SRC
:End:

#+RESULTS:
| lambda | nil | (interactive) |

For example:
#+BEGIN_SRC prolog
magicNumber(7).
magicNumber(9).
magicNumber(42).

% ?- magicNumber(8).
% ?- magicNumber(X).
#+END_SRC

Press ~f6~ to obtain all solutions ~X~ to this query :grin:

Or
#+BEGIN_SRC prolog
main :- write('Hello, world!').

% ?- main.
#+END_SRC

This little setup has made exploring Prolog fun for me; hopefully it will make
Prolog fun for others 😄

:TODOS:
ToDo: Get the query, replace (,) with space, split to words, filter those
that start with a capital letter, these are the variables. Execute:
forall( (query) , ( write("Var0 = "), write(Var0), write(" "), write("Var1 = "), … ) ))
:END:

* Administrivia
/Everything is a relation!/ ---I.e., a table in a database!

#+latex: \vspace{1em}
Whence programs are [[https://blog.algorexhealth.com/2018/11/a-practo-theoretical-introduction-to-logic-programming/][unidirectional]] and can be ‘run in reverse’:
Input arguments and output arguments are the same
thing! Only perspective shifts matter.

#+latex: \vspace{1em}
For example, defining a relation ~append(XS, YS, ZS)~
/intended/ to be true precisely when ~ZS~ is the catenation of ~XS~ with ~YS~,
gives us three other methods besides being a predicate itself!
List construction: ~append([1, 2], [3, 4], ZS)~ ensures ~ZS~ is the catenation list.
List subtraction: ~append([1,2], YS, [1, 2, 3, 4])~ yields all solutions ~YS~ to
the problem ~[1, 2] ++ YS = [1, 2, 3, 4]~.
Partitions: ~append(XS, YS, [1, 2, 3, 4])~ yields all pairs of lists that catenate
to ~[1,2, 3, 4]~. *Four methods for the price of one!*

#+latex: \vspace{1em}
| Prolog is PROgramming in LOGic. |

#+latex: \vspace{0.5em}
In Prolog, the task of the programmer is simply to /describe/ problems
---write down, logically, the situation--- rather than telling the computer
what to do, then obtains information by asking questions
---the logic programming system /figures out how/ to get the answer.

- Prolog is declarative: A program is a collection of ‘axioms’ from which ‘theorems’
  can be proven. For example, consider how sorting is performed:

  + Procedurally: Find the minimum in the remainder of the list, swap it with the head
    of the list; repeat on the tail of the list.

  + Declaratively: ~B~ is the sorting of ~A~ /provided/ it is a permutation of ~A~ and it is
    ordered.

  Whence, a program is a theory and computation is deduction!

#+latex: \vspace{1em}
+ ~swipl -s myprogram.pl~ --Load your program into a REPL, ~?-….~
+ ~make.~ --Reload your program.
+ ~halt.~ --Exit the REPL.
+ ~consult('CheatSheet.pl').~ --Load the contents of the given file as
  the new knowledge base.
+ ~assert((⋯)).~ --Add a new rule to the knowledge base, from within the REPL.
  Use ~retract((⋯))~ to remove rules from the knowledge base.
  - ~assert~ is useful when we want to [[http://cs.union.edu/~striegnk/learn-prolog-now/html/node94.html#sec.l11.database.manip][cache]] computations.
+ ~listing.~ --Display the contents of the current knowledge base; i.e.,
  what Prolog ‘knows’.
+ ~listing(name)~. --List all information in the knowledge base about
  the ~name~ predicate.

* Syntax

There are three types of terms:
+ Constants: Numbers such as -24, and atoms such as ~jasim~, ~'hello world'~,
  ~'&^%&#@$ &*',~ and ~' '~ ---a space in quotes.
+ Variables: Words starting with a capital letter or an underscore.
  - The variable ~_~ is called the /anonymous variable/.

    It's for when we need a variable, say when pattern matching,
    but don't care about the value.

+ Structures: Terms of the form ~functor(term₁,...,termₙ)~.

** ~name~ and ~atom_chars~

The characters between single quotes are the /name/ of an atom
and so Prolog admits ~symbol = 'symbol'~ as true.

+ Atoms, or nullary predicates, are represented as a lists of numbers; ASCII codes.
+ We can use this to compare two atoms lexicographically.
+ We can obtain the characters in an atom by using the built-in ~atom_chars~.
#+BEGIN_SRC prolog :tangle no
?- name(woah, X).       %⇒ X = [119,111,97,104]
?- atom_chars(nice, X). %⇒ X = [n, i, c, e].
#+END_SRC

