CheatSheet.org
* Facts & Relations

We declare relations by having them begin with a lowercase letter;
variables are distinguished by starting with a capital letter.

#
#+begin_parallel org
#+BEGIN_SRC prolog
/* Some facts of our world */
jasim_is_nice.
it_is_raining.

% ?- jasim_is_nice.
% ⇒ true: We declared it so.
#+END_SRC
#+latex: \columnbreak
#+BEGIN_SRC prolog
eats(fred, mangoes).
eats(bob, apples).
eats(fred, oranges).

% Which foods are eaten by fred?
% ?- eats(fred, what).
     %⇒ false; “what” is a name!
% ?- eats(fred, What). %⇒ mangoes oranges
#+END_SRC
#+end_parallel

Relational constraints are formed using ~:-~, which acts as the “provided”, ⇐,
operator from logic. Read ~P :- Q~ as /P is true, provided Q is true./
#
#+begin_parallel org
#+BEGIN_SRC prolog
% All men are mortal.
mortal(X) :- man(X).

% Socrates is a man.
man(socrates).

% Hence, he's expected to be mortal.
% ?- mortal(socrates). %⇒ true
#+END_SRC
#+latex: \columnbreak
#+BEGIN_SRC prolog
% What about Plato?
?- mortal(plato).
%⇒ false, plato's not a man.

% Let's fix that … in the REPL!
?- assert((man(plato))).

% Who is mortal?
?- mortal(X). % ⇒ socrates plato
#+END_SRC
#+end_parallel

* [[http://cs.union.edu/~striegnk/learn-prolog-now/html/node84.html#subsec.l9.operators.def][Mixfix Syntax]]

#
#+begin_parallel org
  It may feel awkward to write ~father_of(homer, bart)~ and instead prefer
~homer father_of bart~. We may declare relations to be prefix, infix, or postfix
with patterns ~xf~, ~xfx~, and ~fx~ respectively. For left associativity
we use pattern ~yfx~ and use ~xfy~ for right associativity.
#+latex: \columnbreak
#+BEGIN_SRC prolog
:- op(35,xfx,father_of).

father_of(me, you).
homer father_of bart.
homer father_of lisa.
#+END_SRC
#+end_parallel

+ Precedence, or binding power, is lowest at 1200 and highest at 0.
+ Note: ~father_of(X,Y) = X father_of Y~ is true.

We may learn about existing operators too;
#+latex: \newline
e.g., ~?- current_op(Prec, Fixity, =:=)~ ^_^

** COMMENT Larger madlibs example
As a larger example, we want to parse ~He ate It in ThePlace and was Emotive.~
as if it were ~He ate (It in (ThePlace and (was Emotive.)))~ So we make the following
declarations.
#+BEGIN_SRC prolog
% madlibs program
:- op(35,xfx,ate).
:- op(34,xfx,in).
:- op(33,xfx,and).
:- op(32,fx,was). % prefix

noun(the_mayor).
noun(jerry_the_duck).
noun(a_microphone).
noun(the_bed).
noun(the_pumpkin).
emotion(elated).

He ate It :- noun(He), noun(It), It \= He.
Action in Place :- noun(Action), noun(Place).
This and That.
was Emotive :- emotion(Emotive).

He ate It in ThePlace and was Emotive
  :- noun(He), noun(It), It \= He,
     noun(ThePlace), emotion(Emotive).

% ?- Who ate jerry_the_duck in the_pumpkin and was elated.
#+END_SRC

Neato!

* Trace & Backtracking

We can see what Prolog does at each step of a computation by invoking
~trace~; we turn off this feature with ~notrace.~

#+latex: \vspace{0.5em}
| /This’ an excellent way to learn how Prolog proof search works! (Debugging!)/ |

#
#+begin_parallel org
Suppose we have the following database.
#+BEGIN_SRC prolog :tangle no
q(1). q(2). q(3).
r(2). r(3).
p(X) :- q(X), r(X).
#+END_SRC
#+latex: \columnbreak
With trace, query ~p(X)~ and press
/SPACE/ each time to see what
Prolog is doing.
At one point, the goal ~r(1)~ will
/fail/ and that choice $X = 1$
will be redone with the next possibility
for ~q~, namely $X = 2$.
#+end_parallel

The line marked ~redo~ is when Prolog realizes its taken the wrong
path, and backtracks to instantiate the variable to 2.

Operationally, query ~p(X)~ is answered by:
1. Find match for the first goal: ~q~ at ~1~.
2. Then see if matches the second: ~r~ at ~1~.
3. (Redo) If not, find another match for the first: ~q~ at ~2~.
4. See if this matches the second, ~r~.
5. Etc.

#+latex: \vspace{2em}\hrule\vspace{1em}

+ ~findall(X, Goal, L)~ succeeds if ~L~ is the list of all those ~X~'s for
  which ~Goal~ holds.

+ ~fail/0~ immediately fails when encountered. Remember: Prolog tries to
  backtrack when its fails; whence ~fail~ can be viewed as an
  instruction to force backtracking.

  The opposite of forcing backtracking is to block it, which is done
  with ‘cut’ ~!~ ---see below.

* What is a Prolog Program Exactly?

  A program /denotes/ all true facts derivable from its clauses using
  *modus ponens, unification, term rewriting, and logical or-&-and*
  for the execution model.

  Hidden Quantifiers:
  | _Syntax_                | _Semantics_                               |
  | ~head(X) :- body(X,Y).~ | $∀ X.\, head(X) \,⇐\, ∃ Y.\, body(X,Y)$ |
  | ~?- Q(X)~               | $∃ X.\, Q(X)$                           |

  1. “ ~head(X)~ is true provided there's some ~Y~ such that ~body(X,Y)~ is true ”
     - ~head.~ is an abbreviation for ~head :- true.~
     - Indeed, $p \;≡\; (p ⇐ true)$.
  2. “ Is there an ~X~ so that ~Q(X)~ is true? ”

** One point rule
“One-Point Rule”: Provided ~X~ is a fresh variable,
| ~f(⋯X⋯) :- X = ℰ𝓍𝓅𝓇.~ | ≈ | ~f(⋯ℰ𝓍𝓅𝓇⋯).~ |

** Overloading

   /Overloading!/ Predicates of different arities are considered different.

   | Documentation Convention: | ~f/N~ | ≈ | /relation ~f~ takes ~N~-many arguments/ |

* Modus Ponens --- Computation ≈ Deduction
  The logical rule $p ∧ (p ⇒ q) \;⇒\; q$ says if we have $p$, and from
  that we know we can get a $q$, then we have a $q$. From the following program
  on the left, we get ~q(a)~ is true.

  #
  #+begin_parallel org
  #+BEGIN_SRC prolog :tangle no
p(a).
q(X) :- p(X).
#+END_SRC
#+latex: \columnbreak
We /rewrite/ term ~X~ with atom ~a~ to obtain ~q(a) :- p(a)~ from the second rule,
but we know ~p(a)~, and so we have /computed/ the new fact ~q(a)~ by using the
deduction rule modus ponens.
#+end_parallel

* Conjunction ≈ Constraints --- Disjunction ≈ Alternatives

Conjunction: ~p(X), q(X)~ means “let ~X~ be /a/ solution to ~p~, then use it in query ~q~.”

#
#+begin_parallel org
Operational semantics: Let ~X~ be the first solution declared, found,
  for ~p~, in the user's script, then try ~q~; if it fails, then /backtrack/
  and pick the next declared solution to ~p~, if any, and repeat until ~q~
  succeeds ---if possible, otherwise fail.
#+latex: \columnbreak
#+BEGIN_SRC prolog
yum(pie).
yum(apples).
yum(maths).

% ?- yum(Y), writeln(Y), fail.
%⇒ pie apples maths false.
#+END_SRC
#+end_parallel

“Fail driven loop” ~p(X), print(X), fail.~ gets a solution to ~p~, prints
it, then fails thereby necessitating a backtrack to obtain a
different solution ~X~ for ~p~, then repeats. In essence, this is prints
all solutions to ~p~.

“Let Clauses”: Provided ~X~ is a fresh variable,
| ~⋯ℰ𝓍𝓅𝓇⋯ℰ𝓍𝓅𝓇⋯~ | ≈ | ~X = ℰ𝓍𝓅𝓇, ⋯X⋯X⋯~ |

A Prolog program is the conjunction of all its clauses, alternatives ‘;’.
#
#+begin_parallel org
#+BEGIN_SRC prolog :tangle no
% (head ⇐ body₁) ∧ (head ⇐ body₂)
head :- body₁.
head :- body₂.
≈
% head  ⇐  body₁ ∨ body₂
head :- body₁ ; body₂.
#+END_SRC
#+latex: \columnbreak
Read ‘⇐’ as ‘≥’, and ‘∨’ as maximum, then the following is the
“characterisation of least upper bounds”.
#+latex: \vspace{0.5em}

 |   | $(p ⇐ q) ∧ (p ⇐ r)$ |
 | ≡ |                     |
 |   | $p ⇐ (q ∨ p)$       |
#+end_parallel

“And binds stronger than Or”: ~a,b;c ≈ (a,b);c~.

