README.md


<a id="org11a6a80"></a>

# Facts & Relations

We declare relations by having them begin with a lowercase letter;
variables are distinguished by starting with a capital letter.

<div class="parallel">
    /* Some facts of our world */
    jasim_is_nice.
    it_is_raining.

    % ?- jasim_is_nice.
    % ⇒ true: We declared it so.

    eats(fred, mangoes).
    eats(bob, apples).
    eats(fred, oranges).

    % Which foods are eaten by fred?
    % ?- eats(fred, what).
         %⇒ false; “what” is a name!
    % ?- eats(fred, What). %⇒ mangoes oranges

</div>

Relational constraints are formed using `:-`, which acts as the “provided”, ⇐,
operator from logic. Read `P :- Q` as *P is true, provided Q is true.*

<div class="parallel">
    % All men are mortal.
    mortal(X) :- man(X).

    % Socrates is a man.
    man(socrates).

    % Hence, he's expected to be mortal.
    % ?- mortal(socrates). %⇒ true

    % What about Plato?
    ?- mortal(plato).
    %⇒ false, plato's not a man.

    % Let's fix that … in the REPL!
    ?- assert((man(plato))).

    % Who is mortal?
    ?- mortal(X). % ⇒ socrates plato

</div>


<a id="org7e5c51a"></a>

# [Mixfix Syntax](http://cs.union.edu/~striegnk/learn-prolog-now/html/node84.html#subsec.l9.operators.def)

<div class="parallel">
  It may feel awkward to write `father_of(homer, bart)` and instead prefer
`homer father_of bart`. We may declare relations to be prefix, infix, or postfix
with patterns `xf`, `xfx`, and `fx` respectively. For left associativity
we use pattern `yfx` and use `xfy` for right associativity.

    :- op(35,xfx,father_of).

    father_of(me, you).
    homer father_of bart.
    homer father_of lisa.

</div>

-   Precedence, or binding power, is lowest at 1200 and highest at 0.
-   Note: `father_of(X,Y) = X father_of Y` is true.

We may learn about existing operators too;

e.g., `?- current_op(Prec, Fixity, =:=)` ^\_^


<a id="org7b75a05"></a>

# Trace & Backtracking

We can see what Prolog does at each step of a computation by invoking
`trace`; we turn off this feature with `notrace.`

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">*This’ an excellent way to learn how Prolog proof search works! (Debugging!)*</td>
</tr>
</tbody>
</table>

<div class="parallel">
Suppose we have the following database.

    q(1). q(2). q(3).
    r(2). r(3).
    p(X) :- q(X), r(X).

With trace, query `p(X)` and press
*SPACE* each time to see what
Prolog is doing.
At one point, the goal `r(1)` will
*fail* and that choice \(X = 1\)
will be redone with the next possibility
for `q`, namely \(X = 2\).

</div>

The line marked `redo` is when Prolog realizes its taken the wrong
path, and backtracks to instantiate the variable to 2.

Operationally, query `p(X)` is answered by:

1.  Find match for the first goal: `q` at `1`.
2.  Then see if matches the second: `r` at `1`.
3.  (Redo) If not, find another match for the first: `q` at `2`.
4.  See if this matches the second, `r`.
5.  Etc.

-   `findall(X, Goal, L)` succeeds if `L` is the list of all those `X`'s for
    which `Goal` holds.

-   `fail/0` immediately fails when encountered. Remember: Prolog tries to
    backtrack when its fails; whence `fail` can be viewed as an
    instruction to force backtracking.

    The opposite of forcing backtracking is to block it, which is done
    with ‘cut’ `!` &#x2014;see below.


<a id="orgd201c75"></a>

# What is a Prolog Program Exactly?

A program *denotes* all true facts derivable from its clauses using
**modus ponens, unification, term rewriting, and logical or-&-and**
for the execution model.

Hidden Quantifiers:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><span class="underline">Syntax</span></td>
<td class="org-left"><span class="underline">Semantics</span></td>
</tr>


<tr>
<td class="org-left">`head(X) :- body(X,Y).`</td>
<td class="org-left">\(∀ X.\, head(X) \,⇐\, ∃ Y.\, body(X,Y)\)</td>
</tr>


<tr>
<td class="org-left">`?- Q(X)`</td>
<td class="org-left">\(∃ X.\, Q(X)\)</td>
</tr>
</tbody>
</table>

1.  “ `head(X)` is true provided there's some `Y` such that `body(X,Y)` is true ”
    -   `head.` is an abbreviation for `head :- true.`
    -   Indeed, \(p \;≡\; (p ⇐ true)\).
2.  “ Is there an `X` so that `Q(X)` is true? ”


<a id="org67c9d9a"></a>

## One point rule

“One-Point Rule”: Provided `X` is a fresh variable,

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">`f(⋯X⋯) :- X = ℰ𝓍𝓅𝓇.`</td>
<td class="org-left">≈</td>
<td class="org-left">`f(⋯ℰ𝓍𝓅𝓇⋯).`</td>
</tr>
</tbody>
</table>


<a id="org0bf2d9a"></a>

## Overloading

*Overloading!* Predicates of different arities are considered different.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Documentation Convention:</td>
<td class="org-left">`f/N`</td>
<td class="org-left">≈</td>
<td class="org-left">*relation `f` takes `N`-many arguments*</td>
</tr>
</tbody>
</table>


<a id="org3dc81b4"></a>

# Modus Ponens &#x2014; Computation ≈ Deduction

The logical rule \(p ∧ (p ⇒ q) \;⇒\; q\) says if we have \(p\), and from
that we know we can get a \(q\), then we have a \(q\). From the following program
on the left, we get `q(a)` is true.

<div class="parallel">
    p(a).
    q(X) :- p(X).

We *rewrite* term `X` with atom `a` to obtain `q(a) :- p(a)` from the second rule,
but we know `p(a)`, and so we have *computed* the new fact `q(a)` by using the
deduction rule modus ponens.

</div>


<a id="org0815789"></a>

# Conjunction ≈ Constraints &#x2014; Disjunction ≈ Alternatives

Conjunction: `p(X), q(X)` means “let `X` be *a* solution to `p`, then use it in query `q`.”

<div class="parallel">
Operational semantics: Let `X` be the first solution declared, found,
  for `p`, in the user's script, then try `q`; if it fails, then *backtrack*
  and pick the next declared solution to `p`, if any, and repeat until `q`
  succeeds &#x2014;if possible, otherwise fail.

    yum(pie).
    yum(apples).
    yum(maths).

    % ?- yum(Y), writeln(Y), fail.
    %⇒ pie apples maths false.

</div>

“Fail driven loop” `p(X), print(X), fail.` gets a solution to `p`, prints
it, then fails thereby necessitating a backtrack to obtain a
different solution `X` for `p`, then repeats. In essence, this is prints
all solutions to `p`.

“Let Clauses”: Provided `X` is a fresh variable,

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">`⋯ℰ𝓍𝓅𝓇⋯ℰ𝓍𝓅𝓇⋯`</td>
<td class="org-left">≈</td>
<td class="org-left">`X = ℰ𝓍𝓅𝓇, ⋯X⋯X⋯`</td>
</tr>
</tbody>
</table>

A Prolog program is the conjunction of all its clauses, alternatives ‘;’.

<div class="parallel">
    % (head ⇐ body₁) ∧ (head ⇐ body₂)
    head :- body₁.
    head :- body₂.
    ≈
    % head  ⇐  body₁ ∨ body₂
    head :- body₁ ; body₂.

Read ‘⇐’ as ‘≥’, and ‘∨’ as maximum, then the following is the
“characterisation of least upper bounds”.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((p ⇐ q) ∧ (p ⇐ r)\)</td>
</tr>


<tr>
<td class="org-left">≡</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(p ⇐ (q ∨ p)\)</td>
</tr>
</tbody>
</table>

</div>

“And binds stronger than Or”: `a,b;c ≈ (a,b);c`.
