CheatSheet.org
* [[http://cs.union.edu/~striegnk/learn-prolog-now/html/node15.html][Unification]]

A program can be written by having nested patterns, terms, then we use
matching to pull out the information we want!

Two terms /match/ or /unify/, if they are equal or if they contain variables that
can be instantiated in such a way that the resulting terms are equal.

#+latex: \vspace{1em}
  + Unification :: Can the given terms be made to represent the same structure?
    - This is how type inference is made to work in all languages.

  + Backtracking :: When a choice in unification causes it to fail, go back to the
    most recent choice point and select the next available choice.

    - Nullary built-in predicate ~fail~ always fails as a goal and causes backtracking.

#+latex: \vspace{0.2em}
** Operational Semantics
   #
   #+begin_parallel org
The unification predicate is ~=/2~. It can be written with the usual
notation ~=(L, R)~ but can also be written infix ~L = R~.
#+latex: \columnbreak
#+BEGIN_SRC prolog
% Query: Who is loved by Jay?
?- loves(jay, X) = loves(jay, kathy).
% ⇒ X = kathy
 #+END_SRC
#+end_parallel

Operationally ~ℒ = ℛ~ behaves as follows:
     1. If either is an unbound variable, assign it to the other one.
        - A constant unifies only with itself.
        - A variable unifies with anything.
     2. Otherwise, they are both terms.
        - Suppose $ℒ ≈ f(e₁,…,eₙ)$ and $ℛ ≈ g(d₁,…,dₘ)$.
        - If ~f~ is different from ~g~, or ~n~ different from ~m~, then crash.
        - Recursively perform ~eᵢ = dᵢ~.

          Ensure the variable instantiations are compatible in that a
          variable is associated with at most one value ---which is
          not true in ~f(1,2) = f(X,X).~

          | *Thus variables are single ‘assignment’!* |

          Exception! Each occurrence of the anonymous variable ~_~
          is independent: Each is bound to something different.

     3. If two terms can't be shown to match using the above clauses,
        then they don't match.

 | /Unification lets us solve equations!/ It lets us *compute!* |

 :Alternative_Explanation:
  1. A constant unifies only with itself.
  2. A variable unifies with anything.
  3. Two structures unify precisely when they have
     the same head and the same number of arguments,
     and the corresponding arguments unify recursively,
     and the variable instantiations are compatible in that
     a variable is associated with at most one value
     ---which is not true in ~f(1,2) = f(X,X).~
  4. If two terms can't be shown to match using Clauses 1-3, then they don't match.
:End:

#+latex: \vspace{1em}
** 'symbol' = symbol

   The query ~'symbol' = symbol~ is true since both are considered to be the same
   atom. Whereas ~'2' = 2~ is false since ~'2'~ is a symbolic atom but ~2~ is a number.

   The /discrepancy predicate/ ~\=/2~ succeeds when its arguments don't unify;
   e.g., ~'5' \= 5~ is true.

#+latex: \vspace{1em}
** Unification performs no simplification, whence no arithmetic

   #
   #+begin_parallel org
   Unification performs no simplification, whence no arithmetic.
This means, for example, we can form pairs by sticking an infix operator between two items; moreover we can form distinct kinds of pairs by using different operators.
#+latex: \columnbreak
#+BEGIN_SRC prolog :tangle no
?- C + "nice" = woah + Z.
C = woah, Z = "nice".

% ‘+’ and ‘/’ are different,
% so no way to make these equal.
?- C + "nice" = woah / Z.
false.
#+END_SRC
#+end_parallel

** COMMENT Informally, in pseudo-Prolog:
#+BEGIN_SRC prolog :tangle no
unify(X, Y) :- X = Y.
unify(X, Y) :- nonvar(X), nonvar(Y), X = Y.
unify(F(X0, …, XN), G(Y0, …, YN)) :- F = G, X_i = Y_i.

% ?- unify(A, B). %⇒ true with A = B.
% ?- unify(1, 2). %⇒ false.

#+END_SRC

* COMMENT ‘=’ is Unification, or ‘incremental tell’

 Here's another example; “wildcard” ~_~ is used to match anything
 ---so-called “anonymous variable”.
 #+BEGIN_SRC prolog
declare Second L
[a b c] = L
L = [_ Second _]
{Show Second} % ⇒ b
 #+END_SRC

 | Whence, pattern matching is unification! |

 Unification is the primary method of computation in [[https://github.com/alhassy/PrologCheatSheet][Prolog]].
* Algebraic Datatypes

Uniform treatment of all datatypes as predicates! Enumerations, pairs, recursives:

#
#+begin_parallel org
_Haskell_
#+BEGIN_SRC haskell :tangle no
data Person = Me | You | Them



data Pair a b = MkPair a b

data Nat = Zero | Succ Nat


sum Zero     n = n
sum (Succ m) n = Succ (sum m n)
#+END_SRC

#+latex: \columnbreak

_Prolog_
#+BEGIN_SRC prolog
person(me).
person(you).
person(them).

pair(_, _).

nat(zero).
nat(succ(N)) :- nat(N).

sum(zero, N, N).
sum(succ(M), N, succ(S))
  :- sum(M, N, S).
#+END_SRC
#+end_parallel

#
# % ?- pair(1, "nice").
# % ?- pair(1, "nice") = pair(A, "nice"). %⇒ A = 1
# % ?- nat(succ(succ(zero))).
# % ?- Two = succ(succ(zero)), Four = succ(succ(succ(succ(zero)))), sum(Two, Two, Four).

Exercise: Form binary trees.
:Answer:
_Binary Trees_ ---Recursive ADTs
#+BEGIN_SRC prolog
% In Haskell: Tree a = Leaf a | Branch (Tree a) (Tree a)

tree(leaf(_)).
tree(branch(L, R)) :- tree(L), tree(R).

% ?- A = leaf(1), B = leaf(2), L = branch(A, B), R = branch(A, A), tree(branch(L, R)).
#+END_SRC
:end:

* Arithmetic with ~is~ ---Using Modules
 Use ~is~ to perform arithmetic with ~+, -, *, /, **, mod~, and
 ~//~ for integer division.
  #+BEGIN_SRC prolog
% How do we make this equation equal?
?- X = 3 + 2.
% ⇒ X = 3 + 2; this choice of variables make its equal!

% Everything is a term! Terms don't ‘compute’!
?- +(3, 2) = 3 + 2. % ⇒ true
?- +(3, 2) = 6 - 1. % ⇒ false

#+END_SRC
#
#+begin_parallel org
#+BEGIN_SRC prolog
?- X is 3 + 2. % ⇒ X = 5
?- 5 is 6 - 1. % ⇒ true
?- 5 is X. % ⇒ CRASH!
?- 3 + 2 is 6 - 1. %⇒ CRASH!
#+END_SRC
#+latex: \columnbreak
#+BEGIN_SRC prolog
?- +(3, 2) =:= 6 - 1. % ⇒ true
?- 1 =:= sin(pi/2).   % ⇒ true
?- X =:= 3 + 2.       % ⇒ CRASH!
?- X = 2, Y = 3, X + Y =:= 5. % ⇒ true
#+END_SRC
#+end_parallel

  # + Unification only tries to make both sides of an equality true by binding free
  #   variables to expressions. It does not do any arithmetic.
  #
  # Comparison operators: ~=, \=, <, >~, ~=<~, and ~>=~.

+ ~is~ takes a /variable, or a numeric constant,/ and an arithmetical
  expression as arguments.
  - ~L is R~ means “ unify ~L~ with the result of simplifying ~R~ ”
  - If ~R~ mentions an unbound variable, crash!
+ ~=:=~ has both arguments as /concrete terms/, it evaluates them and compares the results.
  | ~𝓁 =:= 𝓇~ | ≈ | ~L is 𝓁, R is 𝓇, L = R~. |


# In the context of the CLP(B) library, ~=:=~ is Boolean equality.
# TODO: Show some examples.

** Using Modules

#
#+begin_parallel org

   The [[http://www.swi-prolog.org/pldoc/man?section=clpfd][Constraint Logic Programming over Finite Domains]] library provides a number of
   useful functions, such as ~all_distinct~ for checking a list has unique elements.

 See [[http://www.swi-prolog.org/pldoc/man?section=clpfd-sudoku][here]] for a terse solution to Sudoku.


In particular, ~=:=~ is too low level ---e.g., it doesn't admit unbound variables---
instead one uses ~clpfd~'s ~#=/2~ predicate.

Likewise we could use ~in~ to check if a number is in a particular range, or instead use ~#>/2~ and ~#</2~.

#+latex: \columnbreak
 #+BEGIN_SRC prolog
use_module(library(clpfd)).

?- all_distinct([1,"two", two]).

?- X + 2 #= 3. %⇒ X = 1
?- 1 + Y #= 3. %⇒ Y = 2.
?- X #= Y.     %⇒ Also works ;-)

?- 2 in 0..3.       %⇒ true.
?- 3 #> X, 0 #< X.  %⇒ X in 1..2.

% All parititions of number N ^_^
?- N = 5, between(0, N, X),
   between(0, N, Y), X + Y #= N.
#+END_SRC
#+end_parallel

