README.md


<a id="orgaabb8fb"></a>

# [Unification](http://cs.union.edu/~striegnk/learn-prolog-now/html/node15.html)

A program can be written by having nested patterns, terms, then we use
matching to pull out the information we want!

Two terms *match* or *unify*, if they are equal or if they contain variables that
can be instantiated in such a way that the resulting terms are equal.

-   **Unification:** Can the given terms be made to represent the same structure?
    -   This is how type inference is made to work in all languages.

-   **Backtracking:** When a choice in unification causes it to fail, go back to the
    most recent choice point and select the next available choice.
    -   Nullary built-in predicate `fail` always fails as a goal and causes backtracking.


<a id="org15dfa67"></a>

## Operational Semantics

<div class="parallel">
The unification predicate is `=/2`. It can be written with the usual
notation `=(L, R)` but can also be written infix `L = R`.

    % Query: Who is loved by Jay?
    ?- loves(jay, X) = loves(jay, kathy).
    % ⇒ X = kathy

</div>

Operationally `ℒ = ℛ` behaves as follows:

1.  If either is an unbound variable, assign it to the other one.
    -   A constant unifies only with itself.
    -   A variable unifies with anything.
2.  Otherwise, they are both terms.
    -   Suppose \(ℒ ≈ f(e₁,…,eₙ)\) and \(ℛ ≈ g(d₁,…,dₘ)\).
    -   If `f` is different from `g`, or `n` different from `m`, then crash.
    -   Recursively perform `eᵢ = dᵢ`.

        Ensure the variable instantiations are compatible in that a
        variable is associated with at most one value &#x2014;which is
        not true in `f(1,2) = f(X,X).`

        <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


        <colgroup>
        <col  class="org-left" />
        </colgroup>
        <tbody>
        <tr>
        <td class="org-left">**Thus variables are single ‘assignment’!**</td>
        </tr>
        </tbody>
        </table>

        Exception! Each occurrence of the anonymous variable `_`
        is independent: Each is bound to something different.

3.  If two terms can't be shown to match using the above clauses,
    then they don't match.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">*Unification lets us solve equations!* It lets us **compute!**</td>
</tr>
</tbody>
</table>


<a id="org8ef5c60"></a>

## 'symbol' = symbol

The query `'symbol' = symbol` is true since both are considered to be the same
atom. Whereas `'2' = 2` is false since `'2'` is a symbolic atom but `2` is a number.

The *discrepancy predicate* `\=/2` succeeds when its arguments don't unify;
e.g., `'5' \= 5` is true.


<a id="orga3a1299"></a>

## Unification performs no simplification, whence no arithmetic

<div class="parallel">
   Unification performs no simplification, whence no arithmetic.
This means, for example, we can form pairs by sticking an infix operator between two items; moreover we can form distinct kinds of pairs by using different operators.

    ?- C + "nice" = woah + Z.
    C = woah, Z = "nice".

    % ‘+’ and ‘/’ are different,
    % so no way to make these equal.
    ?- C + "nice" = woah / Z.
    false.

</div>


<a id="org6447078"></a>

# Algebraic Datatypes

Uniform treatment of all datatypes as predicates! Enumerations, pairs, recursives:

<div class="parallel">
<span class="underline">Haskell</span>

    data Person = Me | You | Them



    data Pair a b = MkPair a b

    data Nat = Zero | Succ Nat


    sum Zero     n = n
    sum (Succ m) n = Succ (sum m n)

<span class="underline">Prolog</span>

    person(me).
    person(you).
    person(them).

    pair(_, _).

    nat(zero).
    nat(succ(N)) :- nat(N).

    sum(zero, N, N).
    sum(succ(M), N, succ(S))
      :- sum(M, N, S).

</div>

Exercise: Form binary trees.


<a id="org4994886"></a>

# Arithmetic with `is` &#x2014;Using Modules

Use `is` to perform arithmetic with `+, -, *, /, **, mod`, and
`//` for integer division.

    % How do we make this equation equal?
    ?- X = 3 + 2.
    % ⇒ X = 3 + 2; this choice of variables make its equal!

    % Everything is a term! Terms don't ‘compute’!
    ?- +(3, 2) = 3 + 2. % ⇒ true
    ?- +(3, 2) = 6 - 1. % ⇒ false

<div class="parallel">
    ?- X is 3 + 2. % ⇒ X = 5
    ?- 5 is 6 - 1. % ⇒ true
    ?- 5 is X. % ⇒ CRASH!
    ?- 3 + 2 is 6 - 1. %⇒ CRASH!

    ?- +(3, 2) =:= 6 - 1. % ⇒ true
    ?- 1 =:= sin(pi/2).   % ⇒ true
    ?- X =:= 3 + 2.       % ⇒ CRASH!
    ?- X = 2, Y = 3, X + Y =:= 5. % ⇒ true

</div>

-   `is` takes a *variable, or a numeric constant,* and an arithmetical
    expression as arguments.
    -   `L is R` means “ unify `L` with the result of simplifying `R` ”
    -   If `R` mentions an unbound variable, crash!
-   `=:=` has both arguments as *concrete terms*, it evaluates them and compares the results.

    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


    <colgroup>
    <col  class="org-left" />

    <col  class="org-left" />

    <col  class="org-left" />
    </colgroup>
    <tbody>
    <tr>
    <td class="org-left">`𝓁 =:= 𝓇`</td>
    <td class="org-left">≈</td>
    <td class="org-left">`L is 𝓁, R is 𝓇, L = R`.</td>
    </tr>
    </tbody>
    </table>


<a id="org86bbea7"></a>

## Using Modules

<div class="parallel">


The [Constraint Logic Programming over Finite Domains](http://www.swi-prolog.org/pldoc/man?section=clpfd) library provides a number of
useful functions, such as `all_distinct` for checking a list has unique elements.

See [here](http://www.swi-prolog.org/pldoc/man?section=clpfd-sudoku) for a terse solution to Sudoku.

In particular, `=:=` is too low level &#x2014;e.g., it doesn't admit unbound variables&#x2014;
instead one uses `clpfd`'s `#=/2` predicate.

Likewise we could use `in` to check if a number is in a particular range, or instead use `#>/2` and `#</2`.

    use_module(library(clpfd)).

    ?- all_distinct([1,"two", two]).

    ?- X + 2 #= 3. %⇒ X = 1
    ?- 1 + Y #= 3. %⇒ Y = 2.
    ?- X #= Y.     %⇒ Also works ;-)

    ?- 2 in 0..3.       %⇒ true.
    ?- 3 #> X, 0 #< X.  %⇒ X in 1..2.

    % All parititions of number N ^_^
    ?- N = 5, between(0, N, X),
       between(0, N, Y), X + Y #= N.

</div>
