README.md


<a id="orge54ab30"></a>

# Lists

Lists are enclosed in brackets, separated by commas, and can be split
up at any point by using cons “|”. The empty list is `[]`.

    ?- ["one", two, 3] = [Head|Tail].
    %⇒ Head = "one", Tail = [two, 3].

    ?- ["one", two, 3] = [_,Second|_].
    %⇒ Second = two.

    ?- [[the, Y], Z]   = [[X, hare], [is, here]].
    %⇒ X = the, Y = hare, Z = [is, here]

Searching: \(x ∈ l\)?

    elem(Item, [Item|Tail]). % Yes, it's at the front.
    elem(Item, [_|Tail]) :- elem(Item, Tail). % Yes, it's in the tail.

    % ?- elem(one, [this, "is", one, thing]). %⇒ true
    % ?- elem(onE, [this, "is", one, thing]). %⇒ false

See [here](http://www.swi-prolog.org/pldoc/man?section=lists) for the list library, which includes:

<div class="parallel">
    member(element, list)
    append(list1, list2, lists12)
    prefix(part, whole)
    nth0(index, list, element)
    last(list, element)
    length(list, number)
    reverse(list1, list2)
    permutation(list1, list2)
    sum_list(list, number)
    max_list(list, number)
    is_set(list_maybe_no_duplicates)

In Haskell, we may write `x:xs`, but trying that here forces us to write
`[X|XS]` or `[X|Xs]` and accidentally mismatching the capitalisation of the ‘s’
does not cause a compile-time error but will yield an unexpected logical error
&#x2013;e.g., in the recursive clause use `Taill` instead of `Tail`.
As such, prefer the `[Head|Tail]` or `[H|T]` naming.

</div>

Exercise: Implement these functions.

Hint: Arithmetic must be performed using `is`.


<a id="org9e00a34"></a>

# Declaration Ordering Matters &#x2014;Recursion

Prolog searches the knowledge base from top to bottom, clauses from
left to right, and uses backtracking to recover from bad choices.

When forming a recursive relation, ensure the base case, the
terminating portion, is declared before any portions that require
recursion. Otherwise the program may loop forever.

Unification is performed using depth-first search using the order of
the declared relationships. For example, the following works:

    % Acyclic graph: a ⟶ b ⟶ c ⟶ d
    edge(a, b). edge(b ,c). edge(c, d).

    % Works
    path(X, X).
    path(X, Y) :- edge(Z, Y)  % Can we get to Y from some intermediary Z?
                , path(X, Z). % Can we get to the intermediary Z from X?
    % ?- path(a, d). %⇒ true.

    % Fails: To find a path, we have to find a path, before an edge!
    % The recursive clause is first and so considerd before the base clause!
    path_(X, Y) :- path_(X, Z), edge(Z, Y).
    path_(X, X).
    % ?- path_(a, d). %⇒ loops forever!


<a id="org0df11fd"></a>

# The Cut

Automatic backtracking is great, but can be a waste of time exploring
possibilities that lead nowhere. The atom *cut*, `!`, offers a way to
control how Prolog looks for solutions:
It always succeeds with a side-effect of committing to any choices made thus far
&#x2014;including variable instantiations **and** rule, clause, chosen&#x2014;
whence ignoring any other possible branches and no backtracking!

`q :- p₁, …, pₙ, !, r₁, …, rₘ`
⇒ Once we reach the cut, we're commited to the choices made when evaluating the `pᵢ`,
but we are free to backtrack among the `rᵢ` **and** we may backtrack among the alternatives
for choices that were made before reaching goal `q`. Here's an example.

<div class="parallel">
    i(1). i(2).
    j(1). j(2). j(3).

    k(X, Y) :- i(X), !, j(Y).

    l(X,Y) :- k(X,Y).
    l(0,0).

</div>

Query `l(X, Y)` yields
solutions 1-1, 1-2, 1-3, and 0-0.
Notice that `X = 0, Y = 0` is not
truthified by by the first clause of `l`
but the choice of clause happened before the `k`-clause
containing the cut `!` and so backtracking may pick another `l`-clause.
Notice that without the cut, we have the extra solutions 2-1, 2-2, 2-3
which are “cut out” by `!` since `i(1)` is the choice we committed to for `X = 1`
and we can backtrack for `Y` only since it comes after the cut.

Suppose `x₁` is the first solution found for `p`, then:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">`p(X), q(Y)`</td>
<td class="org-left">≈</td>
<td class="org-left">\(\{ (x, y) ❙ p\, x \,∧\, q\, y\}\)</td>
</tr>


<tr>
<td class="org-left">`p(X), !, q(Y)`</td>
<td class="org-left">≈</td>
<td class="org-left">\(\{ (x₁, y) ❙ q\, y\}\)</td>
</tr>
</tbody>
</table>


<a id="orgba67465"></a>

## Examples

Remember, the cut not only commits to the instantiations so far, but
also commits to the clause of the goal in which it occurs, whence no
other clauses are even tried!

    g(X) :- h(X), !, i(X).
    g(X) :- j(X).

    h(1). h(4). i(3). j(2).

    % ?- g(X). %⇒ fails

There are two clauses to prove `g`, by default we pick the first one.
Now we have the subgoal `h`, for which there are two clauses and we select
the first by default to obtain `X = 1`. We now encounter the cut which means
we have committed to the current value of `X` and the current clause to prove `g`.
The final subgoal is `i(1)` which is false. Backtracking does not allow us to select
different goals, and it does not allow us to use the second clause to prove `g`.
Whence, `g(X)` fails. Likewise we fail for `g(4)`. Note that if we had failed `h`
before the cut, as is the case with `g(2)`, then we fail that clause before encountering
the cut and so the second rule is tried.
