CheatSheet.org
** Disjoint Clauses

   When there are disjoint clauses, i.e., only one succeeds, then if
   backtracking is forced at some point, trying other cases is a waste
   of time since only one clause, say the first one, succeeds.  An
   example of this would be the maximum function or the $\sum_{i=0}^n i$ function.

#
#+begin_parallel
#+BEGIN_SRC prolog
max_(X, Y, Y) :- X =< Y.
max_(X, Y, X) :- X > Y.

% ?- trace.
% ?- max_(3, 4, Y).
% ⇒ Wastes time trying both clauses.

max(X, Y, Y) :- X =< Y, !.
max(X, Y, X) :- X > Y.

% ?- trace.
% ?- max(3, 4, Y).
% ⇒ Only first clause is tried ^_^
#+END_SRC
#+latex: \columnbreak
#+BEGIN_SRC prolog
sum_to(0, 0).
sum_to(N, Res) :- M is N - 1,
                  sum_to(M, ResM),
                  Res is ResM + N.

% Example execution
% ?- sum_to(1, X).
% ⇒ Loops forever: Both clauses apply!

% The fix is to mark the
% first clause as a “base case”.
sum_to(0, 0) :- !.
#+END_SRC
#+end_parallel

The resulting code gives the /same/ results but is more /efficient/.
Such cuts are called /green cuts/. Changes to a program that /depend/
on a cut rather than the logic are called /red cuts/ and are best avoided
---e.g., ~maxNo(X, Y, Y) :- X =< Y, !. maxNo(X, Y, X).~ works by relying on the cut:
It works with variables, but ~maxNo(2, 3, 2)~ matches the second clause unconditionally
even though 2 is not the maximum of 2 and 3!

+ Cut at the end ⇒ Don't consider any more clauses of the current predicate.
   # + At the end, followed by ~fail~ ⇒ Like the above but also simply ~fail~.

** COMMENT Disjoint Clauses  :possibly_better:
#+latex: \vspace{1em}
Common use: When disjoint clauses cannot be enforced by pattern matching.

#+BEGIN_SRC prolog :tangle no
sum_to(0, 0).
sum_to(N, Res) :- M is N - 1, sum_to(M, ResM), Res is ResM + N.

% Example execution
  sum_to(1, X)
⇒ M is 0     --only clause 2 applies

Now both clauses apply.

Clause1: ⇒ ResM = 0, Res = 0.
Clause2: ⇒ M′ is -1, sum_to(M′, ResM′), ⋯
     ⇒ Clause 2 applies here, with M″ = -2.
     ⇒ Loop forever.
#+END_SRC

After we commit to the first clause, /cut/ out all other alternative clauses:
#+BEGIN_SRC prolog
sum_to(0, 0) :- !.
sum_to(N, Res) :- M is N - 1, sum_to(M, ResM), Res is ResM + N.

% ?- sum_to(1, X).
#+END_SRC

It may be clearer to replace cuts with negations so as to enforce disjoint clauses.
#+BEGIN_SRC prolog
sum_to_not(0, 0).
sum_to_not(N, Res) :- N \= 0, M is N - 1, sum_to(M, ResM), Res is ResM + N.

% ?- sum_to_not(5, X). %⇒ X = 15.
#+END_SRC

In general, ~not(G)~ succeeds when /goal/ ~G~ fails.

** Conditional
*Lazy Conditional*
| ~A -> B; C~ | If ~A~ is true, then prove ~B~ and ignore ~C~; else prove ~C~ and ignore ~B~. |

+ The “; C” portion is /optional/ and ~C~ defaults to ~fail~.
+ We can also nest conditionals: ~A₁ -> B₁; ⋯; Aₙ -> Bₙ; C~ ---again, ~C~ is optional.

/We may use this form when we have disjoint conditions ~Aᵢ~!/

However, using multiple clauses is preferable as it clearly separates concerns.

** Cut-fail Combination

   Suppose we want all solutions to ~p~ except ~e~, then we write:
#+BEGIN_SRC prolog :tangle no
all_but_e(X) :- X = e, !, fail.
all_but_e(X) :- p(X).
#+END_SRC

When we pose the query ~all_but_e(e)~, the first rule applies, and we
reach the cut.  This commits us to the choices we have made, and in
particular, blocks access to the second rule. But then we hit
~fail~. This tries to force backtracking, but the cut blocks it, and so
our query fails ---as desired.

# Red cut since it depends on the cut; without it the logic isn't enough
# to ensure the same meaning.
We can package up this red cut into a reusable form, ‘negation as failure’:
#+BEGIN_SRC prolog  :tangle no
% neg(Goal) succeeds iff Goal fails.
neg(Goal) :- Goal, !, fail.
neg(Goal).

all_but_e(X) :- p(X), neg(X = e).
#+END_SRC
The built-in prefix operator ~\+~ is negation as failure
---you may use ~not(⋯)~ but must use the parens and no space before them.

| /Remember: Order matters with Prolog's conjunction/! |

Hence, ~\+ X = e, p(X)~ always fails ---see ~neg~ above---
but ~p(X), \+ X = e~ yields all solutions to ~p~ except ~e~.

:Not_always_cut_clear:
Suppose ~p~ holds if ~a~ and ~b~ hold, or if ~a~ does not hold and ~c~ holds too.
Moreover, suppose ~a~ takes a lot of time to compute; then the program
on the right, with the red cut, is faster.
#+BEGIN_SRC prolog :tangle no
p :- a, b.
p :- \+ a, c

p :- a, !, b.
p :- c.

% or just a conditional
p :- a -> b; c
#+END_SRC
:End:

** Good Exercise

   Comprehension Exercise: With the left-side database, answer the right-side queries.
   #
   #+begin_parallel org
#+BEGIN_SRC prolog  :tangle no
p(1).
p(2) :- !.
p(3).
#+END_SRC
#+latex: \columnbreak
#+BEGIN_SRC prolog  :tangle no
?- p(X).
?- p(X), p(Y).
?- p(X), !, p(Y).
#+END_SRC
#+end_parallel
:answers:
   #+BEGIN_SRC prolog :tangle no
p(X)          ⇒ 1, 2
p(X), p(Y)    ⇒ 1-1, 1-2, 2-1, 2-2
p(X), !, p(Y) ⇒ 1-1, 1-2
#+END_SRC
:end:

** COMMENT Gibberish

  + Ensure deterministic behaviour:
    Discard choice points of ancestor frames.

    - Once a goal has been satisfied, don't try anymore.
      ---Efficient: We wont bother going through all possibilities,
      the first solution found is sufficient for our needs.

    - When a cut, ~“!”~, is encountered, the system is committed to all choices
      made since the parent goal was invoked. All other alternatives are discarded.

  +  ~p(X, a), !~ only produces one answer to ~X~:
    Do not search for additional solutions once /a/ solution has been found to ~p~.

    E.g., only one ~X~ solves the problem and trying to
    find another leads to infinite search ---“green cut”---
    or unintended candidate results ---“red cut”.

* spacing newpage :ignore:
  #+latex: \columnbreak
  # \vfill
* Higher-order Support with ~call~

#
#+begin_parallel org
Prolog is limited to first-order logic: We cannot bind variables to relations.

Prolog /indirectly/ supports higher-order rules.

#+latex: \columnbreak
#+BEGIN_SRC prolog
colour(bike, red).
colour(chair, blue).

% Crashes!
% is_red(C, X, Y) :- C(X, Y)

% Works
is_red(C, X, Y) :- call(C, X, Y).

% ?- is_red(colour, bike, X).
%⇒ X = red.
#+END_SRC
#+end_parallel

Translate between an invocation and a list representation by using ‘equiv’ ~=..~
as follows:
#+BEGIN_SRC prolog :tangle no
?- p(a, b, c) =.. Y.   %⇒ Y = [p, a, b, c].
?- Y =.. [p, a, b, c]. %⇒ Y = p(a, b, c).
#+END_SRC

* spacing COMMENT newpage :ignore:
  #+latex: \columnbreak
  # \vfill
* Meta-Programming

Programs as data: Manipulating Prolog programs with other Prolog programs.

~clause(X, Y~) succeeds when ~X~ is the signature of a relation in the knowledge base,
and ~Y~ is the body of one of its clauses. ~X~ must be provided in the form ~f(X₁, …, Xₙ)~.
#+BEGIN_SRC prolog
test(you, me, us).
test(A, B, C) :- [A, B, C] = [the, second, clause].

% ?- clause(test(Arg1, Arg2, Arg3), Body).
% ⇒ ‘Body’ as well as ‘Arg𝒾’ are unified for each clause of ‘test’.
#+END_SRC

Here is a Prolog interpreter in Prolog ---an approximation to ~call~.
#+BEGIN_SRC prolog
% interpret(G) succeeds as a goal exactly when G succeeds as a goal.

% Goals is already true.
interpret(true) :- !.

% A pair of goals.
interpret((G, H)) :- !, interpret(G), interpret(H).

% Simple goals: Find a clause whose head matches the goal
%               and interpret its subgoals.
interpret(Goal) :- clause(Goal,Subgoals), interpret(Subgoals).

% ?- interpret(test(A, B, C)).
#+END_SRC

Challenge: There are many shortcomings with this interpreter, such as no support for interpreting
recursive functions, negation, failures, and disjunctions. Fix it!

** spacing newpage                                           :ignore:
  #+latex: \columnbreak
   # \vfill
** ~Print, var, nonvar, arg~
 The ~print~ predicate always succeeds, never binds any variables, and prints out its
 parameter as a side effect.

 #+latex: \vspace{1em}
 Use built-ins ~var~ and ~nonvar~ to check if a variable is free or bound.
 #+BEGIN_SRC prolog :tangle no
?- var(Y).           %⇒ true
?- Y = 2, var(Y).    %⇒ false
?- Y = 2, nonvar(Y). %⇒ true
 #+END_SRC

 #+latex: \vspace{1em}
 Built-in ~arg(N,T,A~) succeeds if ~A~ is the ~N~-th argument of the term ~T~.
 #+BEGIN_SRC prolog
% ?- arg(2, foo(x, y), y). %⇒ true
 #+END_SRC

