README.md


<a id="org23e01e5"></a>

## Disjoint Clauses

When there are disjoint clauses, i.e., only one succeeds, then if
backtracking is forced at some point, trying other cases is a waste
of time since only one clause, say the first one, succeeds.  An
example of this would be the maximum function or the \(\sum_{i=0}^n i\) function.

<div class="parallel">
    max_(X, Y, Y) :- X =< Y.
    max_(X, Y, X) :- X > Y.

    % ?- trace.
    % ?- max_(3, 4, Y).
    % ⇒ Wastes time trying both clauses.

    max(X, Y, Y) :- X =< Y, !.
    max(X, Y, X) :- X > Y.

    % ?- trace.
    % ?- max(3, 4, Y).
    % ⇒ Only first clause is tried ^_^

    sum_to(0, 0).
    sum_to(N, Res) :- M is N - 1,
                      sum_to(M, ResM),
                      Res is ResM + N.

    % Example execution
    % ?- sum_to(1, X).
    % ⇒ Loops forever: Both clauses apply!

    % The fix is to mark the
    % first clause as a “base case”.
    sum_to(0, 0) :- !.

</div>

The resulting code gives the *same* results but is more *efficient*.
Such cuts are called *green cuts*. Changes to a program that *depend*
on a cut rather than the logic are called *red cuts* and are best avoided
&#x2014;e.g., `maxNo(X, Y, Y) :- X =< Y, !. maxNo(X, Y, X).` works by relying on the cut:
It works with variables, but `maxNo(2, 3, 2)` matches the second clause unconditionally
even though 2 is not the maximum of 2 and 3!

-   Cut at the end ⇒ Don't consider any more clauses of the current predicate.


<a id="org0e85739"></a>

## Conditional

**Lazy Conditional**

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">`A -> B; C`</td>
<td class="org-left">If `A` is true, then prove `B` and ignore `C`; else prove `C` and ignore `B`.</td>
</tr>
</tbody>
</table>

-   The “; C” portion is *optional* and `C` defaults to `fail`.
-   We can also nest conditionals: `A₁ -> B₁; ⋯; Aₙ -> Bₙ; C` &#x2014;again, `C` is optional.

*We may use this form when we have disjoint conditions `Aᵢ`!*

However, using multiple clauses is preferable as it clearly separates concerns.


<a id="orgdbae64d"></a>

## Cut-fail Combination

Suppose we want all solutions to `p` except `e`, then we write:

    all_but_e(X) :- X = e, !, fail.
    all_but_e(X) :- p(X).

When we pose the query `all_but_e(e)`, the first rule applies, and we
reach the cut.  This commits us to the choices we have made, and in
particular, blocks access to the second rule. But then we hit
`fail`. This tries to force backtracking, but the cut blocks it, and so
our query fails &#x2014;as desired.

We can package up this red cut into a reusable form, ‘negation as failure’:

    % neg(Goal) succeeds iff Goal fails.
    neg(Goal) :- Goal, !, fail.
    neg(Goal).

    all_but_e(X) :- p(X), neg(X = e).

The built-in prefix operator `\+` is negation as failure
&#x2014;you may use `not(⋯)` but must use the parens and no space before them.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">*Remember: Order matters with Prolog's conjunction*!</td>
</tr>
</tbody>
</table>

Hence, `\+ X = e, p(X)` always fails &#x2014;see `neg` above&#x2014;
but `p(X), \+ X = e` yields all solutions to `p` except `e`.


<a id="org84fe2d7"></a>

## Good Exercise

Comprehension Exercise: With the left-side database, answer the right-side queries.

<div class="parallel">
    p(1).
    p(2) :- !.
    p(3).

    ?- p(X).
    ?- p(X), p(Y).
    ?- p(X), !, p(Y).

</div>



<a id="orgc8294a3"></a>

# Higher-order Support with `call`

<div class="parallel">
Prolog is limited to first-order logic: We cannot bind variables to relations.

Prolog *indirectly* supports higher-order rules.

    colour(bike, red).
    colour(chair, blue).

    % Crashes!
    % is_red(C, X, Y) :- C(X, Y)

    % Works
    is_red(C, X, Y) :- call(C, X, Y).

    % ?- is_red(colour, bike, X).
    %⇒ X = red.

</div>

Translate between an invocation and a list representation by using ‘equiv’ `=..`
as follows:

    ?- p(a, b, c) =.. Y.   %⇒ Y = [p, a, b, c].
    ?- Y =.. [p, a, b, c]. %⇒ Y = p(a, b, c).



<a id="org3072386"></a>

# Meta-Programming

Programs as data: Manipulating Prolog programs with other Prolog programs.

`clause(X, Y`) succeeds when `X` is the signature of a relation in the knowledge base,
and `Y` is the body of one of its clauses. `X` must be provided in the form `f(X₁, …, Xₙ)`.

    test(you, me, us).
    test(A, B, C) :- [A, B, C] = [the, second, clause].

    % ?- clause(test(Arg1, Arg2, Arg3), Body).
    % ⇒ ‘Body’ as well as ‘Arg𝒾’ are unified for each clause of ‘test’.

Here is a Prolog interpreter in Prolog &#x2014;an approximation to `call`.

    % interpret(G) succeeds as a goal exactly when G succeeds as a goal.

    % Goals is already true.
    interpret(true) :- !.

    % A pair of goals.
    interpret((G, H)) :- !, interpret(G), interpret(H).

    % Simple goals: Find a clause whose head matches the goal
    %               and interpret its subgoals.
    interpret(Goal) :- clause(Goal,Subgoals), interpret(Subgoals).

    % ?- interpret(test(A, B, C)).

Challenge: There are many shortcomings with this interpreter, such as no support for interpreting
recursive functions, negation, failures, and disjunctions. Fix it!


<a id="org17ed3b0"></a>

## `Print, var, nonvar, arg`

The `print` predicate always succeeds, never binds any variables, and prints out its
parameter as a side effect.

Use built-ins `var` and `nonvar` to check if a variable is free or bound.

    ?- var(Y).           %⇒ true
    ?- Y = 2, var(Y).    %⇒ false
    ?- Y = 2, nonvar(Y). %⇒ true

Built-in `arg(N,T,A`) succeeds if `A` is the `N`-th argument of the term `T`.

    % ?- arg(2, foo(x, y), y). %⇒ true
